eecs435.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-01-14 Thu 22:18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>EECS 435 Notes</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Stephen Brennan" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">EECS 435 Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 2016-01-14 Thursday</a></li>
<li><a href="#orgheadline4">2. 2016-01-12 Tuesday</a>
<ul>
<li><a href="#orgheadline2">2.1. Introductory Material</a></li>
<li><a href="#orgheadline3">2.2. Chapter 5</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 2016-01-14 Thursday</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Illustration of Closed Patterns, Max-Patterns</b>
</p>

<ul class="org-ul">
<li>If your DB is {&lt;a<sub>1</sub>, &#x2026;, a<sub>100</sub>&gt;, &lt;a<sub>1</sub>, &#x2026;, a<sub>50</sub>&gt;}, and your minimum (absolute)
support is 1:</li>
<li>Closed itemsets:
<ul class="org-ul">
<li>&lt;a<sub>1</sub>, &#x2026;, a<sub>100</sub>&gt;</li>
<li>&lt;a<sub>1</sub>, &#x2026;, a<sub>50</sub>&gt;</li>
</ul></li>
<li>Max itemsets:
<ul class="org-ul">
<li>&lt;a<sub>1</sub>, &#x2026;, a<sub>100</sub>&gt;</li>
</ul></li>
</ul>

<p>
<b>Algorithm</b>
</p>
<ul class="org-ul">
<li>Subsets of frequent itemsets are frequent as well.</li>
<li>So itemsets which are infrequent should not have their supersets generated
or tested.</li>
<li>Method (Apriori Algorithm):
<ul class="org-ul">
<li>Initially, scan DB once to get frequent 1-itemsets</li>
<li>Generate length (k+1) candidate itemsets from length k frequent itemsets</li>
<li>Test the candidates against DB</li>
<li>Terminate when no frequent or candidate set can be generated</li>
</ul></li>
<li>Seems simple, but there are lost of detail on the algorithm.</li>
<li>How to generate candidates?  Two steps:
<ul class="org-ul">
<li>Step 1: self-joining</li>
<li>Step 2: pruning</li>
</ul></li>
<li>Example of candidate generation:
<ul class="org-ul">
<li>l<sub>3</sub> = {abc, abd, acd, ace, bcd}</li>
<li>First, compute L<sub>3</sub> * L<sub>3</sub> (cartesian product, sort of)</li>
<li>abcd from abc and abd</li>
<li>acde from acd and ace</li>
<li>However, groups like acde are removed because their superset (ade) are not
in the previous frequent itemset.</li>
</ul></li>
<li>There was some Candidate Generation pseudo-code written in a SQL-like syntax
that was rather confusing.</li>
<li>The pruning is pretty simple because you just need to check the k subsets of
size k-1 to make sure they are all frequent.</li>
<li>Counting support of candidates:
<ul class="org-ul">
<li>Candidates are stored in a hash-tree</li>
<li>A leaf node contains a list of itemsets and counts.</li>
<li>Interior node contains a hash table of something (I hope the slides go up
soon)</li>
</ul></li>
<li>The issues for frequent pattern mining are:
<ul class="org-ul">
<li>Multiple scans of transaction database</li>
<li>Huge number of candidates</li>
<li>Tedious workload of support counting for candidates.</li>
</ul></li>
<li>The improvements to the algorithm aim to address these concerns.</li>
<li>Partitioning:
<ul class="org-ul">
<li>Itemsets that are potentially frequent must be frequent in at least one of
the partitions.</li>
</ul></li>
<li>DHP: Reduce the number of candidates
<ul class="org-ul">
<li>A k-itemset whose corresponding hashing bucket count is below the
threshold cannot be frequent.</li>
</ul></li>
</ul>

<p>
Multiple-Level Association Rules
</p>
<ul class="org-ul">
<li>Items frequently form hierarchies, eg milk can be whole, skim, 2%, etc.</li>
<li>May want to have different support thresholds for lower levels of the
hierarchy.</li>
<li>Need to filter "redundant" association rules where child items are involved
but they add no more information to the parent rule.</li>
</ul>

<p>
Constraint based mining
</p>
<ul class="org-ul">
<li>Anti-monotone constraint: when an itemset S violates a constraint, so do all
supersets of S.</li>
<li>Monotone constraint: when an itemset S satisfies a constraint, so do all
supersets of S.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">2</span> 2016-01-12 Tuesday</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> Introductory Material</h3>
<div class="outline-text-3" id="text-2-1">
<p>
I was late (and probably will be late frequently due to another class).
Hopefully I didn't miss too much.
</p>

<p>
Grading:
</p>
<ul class="org-ul">
<li>30% paper presentation</li>
<li>10% attendance, participation</li>
<li>60% project</li>
</ul>

<p>
Paper presentation:
</p>
<ul class="org-ul">
<li>Group of two</li>
<li>Present one or two papers.</li>
<li>Lead discussion.</li>
<li>May be helpful to read a few references.</li>
</ul>

<p>
Project:
</p>
<ul class="org-ul">
<li>Best to come up with your own ideas, but he does have some ideas on his
slides.</li>
<li>Project proposal (3-5 pages, due Feb 16) should include:
<ul class="org-ul">
<li>Title, idea, survey of related work, data source, key
algorithms/technology, and what you expect to submit at the end of the
semester.</li>
</ul></li>
<li>Final report (1-20 pages, due April 21) must include:
<ul class="org-ul">
<li>Comprehensive description of your project</li>
<li>Project idea, extended survey of related work, result, etc.</li>
<li>What worked, what didn't work, what surprised you, etc.</li>
</ul></li>
</ul>

<p>
Data mining conferences:
</p>
<ul class="org-ul">
<li>ACM-SIGKDD</li>
<li>IEEE-ICDM</li>
<li>SIAM-DM</li>
<li>PKDD</li>
<li>PAKDD</li>
</ul>

<p>
Journal:
</p>
<ul class="org-ul">
<li>Data Mining and Knowledge Discovery</li>
<li>KDD Explorations</li>
</ul>

<p>
Other references can be found in the conferences and journals for the fields:
</p>
<ul class="org-ul">
<li>Database systems</li>
<li>Artificial Intelligence</li>
<li>Statistics</li>
<li>Bioinformatics</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> Chapter 5</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>Mining Frequent Patterns, Association, and Correlations</b>
</p>

<ul class="org-ul">
<li>Original slides at: <a href="http://www.cs.uiuc.edu/homes/hanj/bk2/slidesindex.htm">http://www.cs.uiuc.edu/homes/hanj/bk2/slidesindex.htm</a>
     (broken link).</li>
<li>Frequent pattern analysis - finding items, subsequences, substructures,
etc, that occur frequently in a data set.
<ul class="org-ul">
<li>Related - frequent itemsets, association rule mining</li>
<li>Agrawal, Imielinski, and Swami '93 introduced these ideas</li>
</ul></li>
<li>Motivation is to find regularities, rules, etc that give you insight into
data.  For instance:
<ul class="org-ul">
<li>Beer and diapers are frequently purchased together.</li>
<li>What are subsequent purchases after a PC?</li>
</ul></li>
<li>Itemset: a set of items</li>
<li>k-itemset: an itemset containing k items</li>
<li>Call the set of all items \(I = \{I_1, \dots, I_m\}\)</li>
<li>\(T \subseteq I\) is a transaction, and has a transaction id.</li>
<li>An association rule is of the form \(A \to B\), with minimum support and
confidence, where \(A \subset I\), \(B \subset I\), \(A \cap B =
     \emptyset\).</li>
<li>Support (for \(A \to B\)) is \(Pr[A \cup B \subseteq T]\).
<ul class="org-ul">
<li>That is, the probability that a transaction contains all of A and B.</li>
<li>As a percentage, also referred to as relative support.</li>
<li>As a number, referred to as the absolute support</li>
</ul></li>
<li>Confidence (for \(A \to B\)) is \(Pr[B \subset T | A \subset T]\)
<ul class="org-ul">
<li>That is, the conditional probability that a transaction contains B, given
it contains A.</li>
<li>\(Pr[B \subset T | A \subset T] = \frac{Pr[B \cup A \subseteq T]}{Pr[A
       \subset T]} = \frac{support(A \cup B)}{support(A)}\)</li>
</ul></li>
<li>Confidence can be easily derived from the support of \(A\) and \(A \cup
     B\).  Which means you can "reduce" this problem to finding itemsets with
high confidence, and then looking for disjoint pairs with high confidence.</li>
<li>Big patterns have lots of subsets, and therefore lots of other frequent
patterns.  So, you want to find closed patterns and max-patterns.</li>
<li>Closed pattern: X is closed if X is frequent and there is no super-pattern
\(Y \supset X\) with the same support as X.</li>
<li>An itemset X is a max-pattern if X is frequent and there is no frequent
super-pattern \(Y \supset X\).
<ul class="org-ul">
<li>A "maximal" frequent super-pattern.</li>
<li>All max-patterns are closed.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Stephen Brennan</p>
<p class="date">Created: 2016-01-14 Thu 22:18</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
